app/views/payments/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
SELECT SUM("payments"."amount") FROM "payments" INNER JOIN "groups_payments" ON "payments"."id" = "groups_payments"."payment_id" WHERE "groups_payments"."group_id" = $1  [["group_id", 3]]
---
<div style="width:100%; background-color: white;box-shadow: 0px 3px 4px #ccc">
<% @groups = Group.where(user_id: @user.id)
    @group_totals = @groups.to_h { |group| [group.id, group.payments.sum(:amount)] }