app/views/payments/new.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
---
      <p>categories</p>
      <%= form.collection_select(:group_ids, current_user.groups, :id, :name, { selected: @group.id }, { multiple: true, class: "input-div" }) %>